; 在应用序的scheme里, (* n (factorial (- n 1))) 会被不断展开直到栈溢出
; 在正则序中则会在 (= n 1) 时才回溯展开，直到得出结果

;;  n = 5
;;  (= n 1)
;;      (* n (factorial (- n 1)))
;;          n' = (- n 1) = 4
;;          (= n' 1)
;;              (* n' (factorial (- n' 1)))
;;                  ........
;;                          n'''' = (- (- (- (- n 1) 1) 1) 1) = 1
;;                          (= n'''' 1)
;;                              1
;;                      (* n''' 1) ; n''' = 2
;;                  (* n'' 2) ; n'' = 3
;;              (* n' 6) ; n' = 4
;;          (* n 24) ; n = 5
;;      120
